<a href="https://colab.research.google.com/github/fazlerabbi125/BRAC-AI-tutorials/blob/main/Copy_of_PandasFinalVersion.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# CSE422: Introduction to Pandas
---


Pandas is an open-source library built on top of numpy providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dictionary of Series objects.

#Series : First main data type in Pandas

In [ ]:

import pandas as pd
labels =['a','b','c']
my_data=[10,20,30]

d={'a':10,'b':10,'c':30}

In [ ]:
pd.Series(d)

a    10
b    10
c    30
dtype: int64

#DataFrame

In [ ]:

import numpy as np

x=np.random.randint(100,size=(5,4))

import pandas as pd
#df =pd.DataFrame(x)
df =pd.DataFrame(x,['x','b','c','d','e'],['W','X','Y','Z'])
print(df)

    W   X   Y   Z
x  31  80  22  23
b  97   8   7  25
c  49  91   6  91
d  12  62  20  61
e  24  37  27  27

In [ ]:
df['X']

In [ ]:
#ENTERING ANATHER COLUMN IN A DATAFRAME
df['new_col']=[1,2,3,4,5]
df

In [ ]:
#how delete column in dataframe:
df.drop('Y',axis=1,inplace=True)
print(df)

In [ ]:
#how delete column in dataframe:
df.drop('c',axis=0,inplace=True)
print(df)

#Importing pandas library and reading a CSV file into a dataframe.

In [ ]:
 df = pd.read_csv('/content/sample_data/sales.csv',index_col='month')
 df.head()

# Indexing DataFrames

## Indexing using square brackets

In [ ]:
df = pd.read_csv('/content/sample_data/sales.csv',index_col='month')
df.head()

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0     0
May     132   NaN    52

In [ ]:
 df['eggs']['Mar'] # df[column]['rows']
 type(df)

In [ ]:
df.eggs['Apr']

Using column atribute and row index/label

In [ ]:
df.salt['Apr']

Selecting only some columns

In [ ]:
df_new = df[['salt','spam']]
df_new

Selecting a column (i.e., Series)

In [ ]:
 df['eggs']

In [ ]:
#printing type of the column selected
type(df['eggs'])

Slicing and indexing a Series

In [ ]:
#selecting part of a series
df['eggs'][1:4]

In [ ]:
df['eggs'][4]

# Slicing DataFrames

Using the .loc accessor
* Access a group of rows and columns by label(s) or a boolean array.

A series is a 1D-array that can store any data type

* LOC is not based on index. The stop limit is **not** exclusive
* ILOC is based on index. The stop limit is exclusive

In [ ]:
#we can access row by 2 ways:
# 1. location based selection .loc('rowname')
# 2. numerical based selection  iloc(rowindex)
df2.loc[:,'X']

In [ ]:
df

In [ ]:
df.loc['Feb':'Mar','eggs':'salt']

In [ ]:
df.loc['Feb',:]   #df.loc[rows,column]

In [ ]:
 df.loc['Jan': 'Mar', ['eggs','spam']]

In [ ]:
df.loc[:, ['eggs','salt']]   # All rows, some columns

In [ ]:
 df.loc['Jan':'Apr',:]  # Some rows, all columns

In [ ]:
df.loc['Mar':'May', 'salt':'spam']

Using the .iloc accessor
* Purely integer-location based indexing for selection by position.

In [ ]:
df

In [ ]:
df.iloc[2]  #indexwise
df.iloc[2,2]

In [ ]:
 df.iloc[2:4, 2]

In [ ]:
 df

In [ ]:
df.iloc[2:5, 1:] # A block from middle of the DataFrame

Using lists rather than slices (1)

In [ ]:
df.loc['Jan':'May', ['eggs','salt']]

Using lists rather than slices (2)

In [ ]:
df.iloc[[0,4,5], 0:2]

Series versus 1-column DataFrame

In [ ]:
 df['eggs']

In [ ]:
type(df['eggs'])

In [ ]:
df[['eggs']]

In [ ]:
type(df[['eggs']])

#Filtering DataFrames

Creating a Boolean Series

In [ ]:
df

In [ ]:
df['salt'] > 60

Filtering with a Boolean Series

In [ ]:
df.salt > 60

In [ ]:
a = df.salt > 60

In [ ]:
type(a) #this is a series

In [ ]:
df[a]

In [ ]:
df[df.salt>60] )

Combining filters

In [ ]:
(df.salt >= 50) & (df.eggs < 200)

In [ ]:
 df[(df.salt >= 50) & (df.eggs < 200)] # Both conditions

In [ ]:
(df.salt >= 50) | (df.eggs < 200)

In [ ]:
 df[(df.salt >= 50) | (df.eggs < 200)] # Either condition

#DataFrame Append

In [ ]:
df2 = df.copy()
df2

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0     0
May     132   NaN    52
Jun     205  60.0    55

In [ ]:
 df2['bacon']=[0,0,60,0,90,100]
 df2

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     60
Apr      77  87.0     0      0
May     132   NaN    52     90
Jun     205  60.0    55    100

In [ ]:
df3=df2.copy()
df3

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     60
Apr      77  87.0     0      0
May     132   NaN    52     90
Jun     205  60.0    55    100

In [ ]:
other = pd.DataFrame({'eggs': ['K0', 'K1', 'K2'],
                      'salt': ['b10', 'b20', 'b50'],
                      'spam': ['s1', 's2', 's3'],
                      'bacon': ['bc0', 'bc1', 'cb2']},index=["July", "Aug", "Sept"])
other

     eggs salt spam bacon
July   K0  b10   s1   bc0
Aug    K1  b20   s2   bc1
Sept   K2  b50   s3   cb2

In [ ]:
df2.append(other)

     eggs salt spam bacon
Jan    47   12   17     0
Feb   110   50   31     0
Mar   221   89   72    60
Apr    77   87    0     0
May   132  NaN   52    90
Jun   205   60   55   100
July   K0  b10   s1   bc0
Aug    K1  b20   s2   bc1
Sept   K2  b50   s3   cb2

In [ ]:
df3

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     60
Apr      77  87.0     0      0
May     132   NaN    52     90
Jun     205  60.0    55    100

In [ ]:
df3.columns=['X', 'Y', 'Z','T']
df3

         X     Y   Z    T
month
Jan     47  12.0  17    0
Feb    110  50.0  31    0
Mar    221  89.0  72   60
Apr     77  87.0   0    0
May    132   NaN  52   90
Jun    205  60.0  55  100

In [ ]:
df3.drop("T",axis=1,inplace=True)
df3

         X     Y   Z
month
Jan     47  12.0  17
Feb    110  50.0  31
Mar    221  89.0  72
Apr     77  87.0   0
May    132   NaN  52
Jun    205  60.0  55

#DataFrames with zeros and NaNs

Select columns with all nonzeros

In [ ]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0     0
May     132   NaN    52
Jun     205  60.0    55

In [ ]:

df['bacon']=[0,0,0,0,0,1]
df['bacon'].any()

True

In [ ]:
df

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72      0
Apr      77  87.0     0      0
May     132   NaN    52      0
Jun     205  60.0    55      1

In [ ]:

df.loc[:, df.all()]

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0

Select columns with any NaNs

In [ ]:
df.loc[:, df.isnull().any()]

       salt
month
Jan    12.0
Feb    50.0
Mar    89.0
Apr    87.0
May     NaN
Jun    60.0

Select columns without NaNs

In [ ]:
df

In [ ]:
df.loc[:, df.notnull().any()]

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72      0
Apr      77  87.0     0      0
May     132   NaN    52      0
Jun     205  60.0    55      1

Drop rows with any NaNs

In [ ]:
df.dropna(how='any')

In [ ]:
from google.colab import drive
drive.mount('/content/drive',)

In [ ]:
df

In [ ]:
df.salt > 55

Filtering a column based on another

In [ ]:
df.eggs[df.salt > 55]  #returns a series